In [1]:
# Importing Libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

# Loading Data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

# Data Cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [2]:
df.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [3]:
df.tail()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

In [5]:
df.sample(10)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
518701,Business Analyst,Alternance - Chargé.e de gestion Reporting et ...,"Toulouse, France",via LinkedIn,Full-time,False,France,2023-06-09 11:20:42,False,False,France,None,NaN,NaN,Vitesco Technologies,"['power bi', 'sap', 'excel']","{'analyst_tools': ['power bi', 'sap', 'excel']}"
265110,Machine Learning Engineer,MLOPS AI Engineer,"Shanghai, China",via Trabajo.org,Full-time,False,China,2023-10-23 07:49:25,False,False,China,None,NaN,NaN,Accenture,None,None
329236,Data Engineer,Azure Data Engineer,"London, UK",via Recruit.net,Full-time,False,United Kingdom,2023-02-12 23:39:03,True,False,United Kingdom,None,NaN,NaN,Jefferson Frank,"['python', 'sql', 'azure', 'databricks', 'pysp...","{'cloud': ['azure', 'databricks'], 'libraries'..."
212928,Data Scientist,Data Scientist,"Cambridge, UK",via WDHN Jobs,Full-time,False,United Kingdom,2023-04-05 22:19:41,False,False,United Kingdom,None,NaN,NaN,Umbilical Ltd,"['numpy', 'pandas', 'keras', 'scikit-learn', '...","{'libraries': ['numpy', 'pandas', 'keras', 'sc..."
648733,Data Engineer,Lead Data Engineer,"Nashville, TN",via JobServe,Full-time,False,"California, United States",2023-08-11 12:09:52,True,False,United States,None,NaN,NaN,TEKsystems,"['sql', 'python', 'aws', 'redshift', 'aurora',...","{'cloud': ['aws', 'redshift', 'aurora'], 'libr..."
653247,Senior Data Engineer,"Sr. Data Engineer, Cross Product Change Servic...","Newark, DE",via LinkedIn,Full-time,False,Sudan,2023-02-18 10:36:47,False,True,Sudan,None,NaN,NaN,JPMorgan Chase & Co.,"['sql', 'nosql', 'tableau', 'qlik', 'alteryx']","{'analyst_tools': ['tableau', 'qlik', 'alteryx..."
212277,Data Scientist,Database Engineer,"Panama City, Panama",via LinkedIn Panamá,Full-time,False,Panama,2023-11-22 23:00:54,True,False,Panama,None,NaN,NaN,Smartmatic,"['sql', 'bash', 'postgresql', 'oracle', 'unix']","{'cloud': ['oracle'], 'databases': ['postgresq..."
766570,Business Analyst,Senior Business Intelligence Analyst,"Charlotte, NC",via Jobs Trabajo.org,Full-time,False,Georgia,2023-08-25 02:05:22,True,False,United States,None,NaN,NaN,BrightSpeed,"['power bi', 'ssrs', 'tableau', 'looker']","{'analyst_tools': ['power bi', 'ssrs', 'tablea..."
456081,Senior Data Analyst,Forensics and Litigation Services Senior Assoc...,"Dallas, TX",via LinkedIn,Full-time,False,"Texas, United States",2023-07-20 14:02:06,False,False,United States,None,NaN,NaN,Weaver,"['sql', 'sql server', 'tableau', 'power bi']","{'analyst_tools': ['tableau', 'power bi'], 'da..."
508940,Senior Data Engineer,(Senior) Data Engineer (m/w/d) in Düsseldorf,"Düsseldorf, Germany",via LinkedIn,Full-time,False,Germany,2023-05-17 11:41:01,True,False,Germany,None,NaN,NaN,BearingPoint,"['sql', 'python', 'java', 'scala', 'aws', 'azu...","{'cloud': ['aws', 'azure'], 'libraries': ['had..."

## `copy()`

In [6]:
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [8]:
df_altered = df_original

In [10]:
df_altered.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64

In [12]:
median_salary = df_altered['salary_year_avg'].median()

median_salary

115000.0

In [13]:
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [14]:
df_original.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [15]:
id(df_original)

2842184903696

In [16]:
id(df_altered)

2842184903696

In [17]:
id(df_original) == id(df_altered)

True

In [18]:
dataset = load_dataset('lukebarousse/data_jobs')
df_original = dataset['train'].to_pandas()

In [19]:
df_altered = df_original.copy()

In [20]:
print('ID of df_original:           ', id(df_original))
print('ID of df_altered:            ', id(df_altered))
print('Are the two dataframes the same?', id(df_original) == id(df_altered))

ID of df_original:            2842689351504
ID of df_altered:             2842689454544
Are the two dataframes the same? False

In [21]:
median_salary = df_altered['salary_year_avg'].median()

df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_salary)

df_altered.loc[:5, 'salary_year_avg']

0    115000.0
1    115000.0
2    115000.0
3    115000.0
4    115000.0
5    115000.0
Name: salary_year_avg, dtype: float64

In [22]:
df_original.loc[:5, 'salary_year_avg']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
Name: salary_year_avg, dtype: float64